/* Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной (number * number). */

public class Solution {
    public static int number = 25;

  
    public static void main(String[] args) {
        int number = 25;
        System.out.println("Переменная: "+number);
        int num1 = 25;
        System.out.println("Квадрат переменной = "+num1*num1);
    }
}
