/* Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной (number * number). */

public class Solution {
    public static int number = 25;

  
    public class Main {
    public static int number = 25;


    public static void main(String[] args) {
        System.out.println("Переменная: "+number);
        System.out.println("Квадрат переменной = "+number*number);
    }
}
